Jackhenry/xmlTemplates/custreladd_owner.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                <wsse:Username>{{XUserName}}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{XPassword}}</wsse:Password>
                <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">{{current_timestamp}}</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <CustRelAdd
            xmlns="http://jackhenry.com/jxchange/TPG/2008">
            <MsgRqHdr>
                <jXchangeHdr>
                    <JxVer />
                    <AuditUsrId>{{XAuditUser}}</AuditUsrId>
                    <AuditWsId>{{XAuditWorkStation}}</AuditWsId>
                    <AuthenUsrId />
                    <ConsumerName />
                    <ConsumerProd />
                    <Ver_1 />
                    <jXLogTrackingId>{{$guid}}</jXLogTrackingId>
                    <Ver_2 />
                    <InstRtId>{{XInstitutionRoutingID}}</InstRtId>
                    <InstEnv>{{XEnvironment}}</InstEnv>
                    <Ver_3 />
                    <BusCorrelId>{{$guid}}</BusCorrelId>
                    <Ver_4 />
                    <WorkflowCorrelId />
                    <Ver_5 />
                    <ValidConsmName>{{XValidConsumerName}}</ValidConsmName>
                    <ValidConsmProd>{{XValidConsumerProduct}}</ValidConsmProd>
                    <Ver_6 />
                </jXchangeHdr>
                <Ver_1 />
                <Ver_2 />
                <Ver_3 />
            </MsgRqHdr>
            <CustId>{{CustRelAdd.CustId}}</CustId>
            <CustRelRec>
                <Ver_1 />
                <Ver_2 />
                <Ver_3 />
                <IdVerifyBy>{{CustRelAdd.CustRelRec.IdVerifyBy}}</IdVerifyBy>
                <IdVerifyRsnCode>{{CustRelAdd.CustRelRec.IdVerifyRsnCode}}</IdVerifyRsnCode>
                <VerifyDt>{{CustRelAdd.CustRelRec.VerifyDt}}</VerifyDt>
                <Ver_4 />
            </CustRelRec>
            <Ver_1 />
            <BenflOwnInfo>
                <CustId>{{CustRelAdd.BenflOwnInfo.CustId}}</CustId>
                <PersonName>
                    <ComName>{{CustRelAdd.BenflOwnInfo.PersonName.ComName}}</ComName>
                    <Ver_1 />
                </PersonName>
                <BenflOwnType>{{CustRelAdd.BenflOwnInfo.BenflOwnType}}</BenflOwnType>
                <CntlIndivTitle>{{CustRelAdd.BenflOwnInfo.CntlIndivTitle}}</CntlIndivTitle>
                <BenflOwnPct>{{CustRelAdd.BenflOwnInfo.BenflOwnPct}}</BenflOwnPct>
                <Ver_1 />
            </BenflOwnInfo>
            <Ver_2 />
            <Ver_3 />
        </CustRelAdd>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>